#include "menu.h"

#include <iostream>
using namespace std;

void Menu::Start() {
    cout << "----------------------------------------------------------------"
         << endl
         << "欢迎进入图书馆管理系统" << endl
         << "请选择操作：" << endl
         << "1: 登录账户" << endl
         << "2: 注册账户" << endl
         << "0: 退出系统" << endl
         << "> ";
}

void Menu::Main() {
    cout << "----------------------------------------------------------------"
         << endl
         << "请选择需要执行的操作：" << endl
         << "1: 添加新书" << endl
         << "2: 查找书籍" << endl
         << "3: 修改书籍信息" << endl
         << "4: 删除书籍" << endl
         << "5: 借阅管理" << endl
         << "0: 退出账号" << endl
         << "> ";
}

void Menu::Find() {
    cout << "----------------------------------------------------------------"
         << endl
         << "请选择查询方式：" << endl
         << "1: 按书籍编号查询" << endl
         << "2: 按 ISBN 查询" << endl
         << "3: 查看全部书籍" << endl
         << "0: 返回主菜单" << endl
         << "> ";
}

void Menu::Update() {
    cout << "----------------------------------------------------------------"
         << endl
         << "请选择修改方式：" << endl
         << "1: 根据书籍编号修改" << endl
         << "2: 根据 ISBN 修改" << endl
         << "0: 返回主菜单" << endl
         << "> ";
}

void Menu::Remove() {
    cout << "----------------------------------------------------------------"
         << endl
         << "请选择删除方式：" << endl
         << "1: 根据书籍编号删除" << endl
         << "2: 根据 ISBN 删除" << endl
         << "0: 返回主菜单" << endl
         << "> ";
}

void Menu::LendOrReturn() {
    cout << "----------------------------------------------------------------"
         << endl
         << "请选择操作：" << endl
         << "1: 借阅书籍" << endl
         << "2: 归还书籍" << endl
         << "3: 查看所有借出的书籍" << endl
         << "0: 返回主菜单" << endl
         << "> ";
}